[ 
  {
    "title": "Emergency Auto-Clear Protection",
    "timestamp": "2025-07-15 22:45",
    "description": "Added a safety mechanism to automatically clear the terminal buffer if the number of lines exceeds 12,000. This prevents performance issues and browser slowdowns. A system message is displayed to inform the user."
  },
  {
    "title": "Social Media Footer with GitHub",
    "timestamp": "2025-07-13 18:20",
    "description": "The application footer now includes official social media icons for Twitter, YouTube, X, Viber, WhatsApp, Telegram, TikTok, Pinterest, and GitHub. Each icon uses its official brand color and links to your profiles."
  },
  {
    "title": "Web Serial API Support Notice",
    "timestamp": "2025-07-13 18:00",
    "description": "Improved visual notification for unsupported browsers. Overlay appears only when Web Serial API is unavailable."
  },
  {
    "title": "AutoClear Behavior Fixed",
    "timestamp": "2025-07-13 17:45",
    "description": "AutoClear now updates immediately when changed via settings, even during active connection."
  },
  {
    "title": "Export Button for CSV/JSON Output",
    "timestamp": "2025-07-12 20:30",
    "description": "A new Export button allows users to save the terminal buffer in either CSV or JSON format. The export respects the timestamp setting and prompts the user for format selection."
  },
  {
    "title": "Export Button Styling with Theme Support",
    "timestamp": "2025-07-12 20:10",
    "description": "The Export button is styled in purple to distinguish it from existing action buttons. It supports both light and dark themes with consistent appearance."
  },
  {
    "title": "RTS/DTR Status Indicators",
    "timestamp": "2025-07-12 17:30",
    "description": "Visual indicators for RTS and DTR have been added next to the terminal controls, using colored circles (green for on, red for off) along with a tooltip. Status updates automatically on Connect, Save Settings, or Reset."
  },
  {
    "title": "RTS/DTR Control in Settings",
    "timestamp": "2025-07-12 16:55",
    "description": "RTS and DTR options can now be configured through the Settings modal using checkboxes. Default values are set to 'true' to match Web Serial API behavior."
  },
  {
    "title": "Live Status Refresh After Settings Change",
    "timestamp": "2025-07-12 16:35",
    "description": "Changes to RTS/DTR settings via Save or Reset are now reflected immediately in the status display without requiring a reconnect."
  },
  {
    "title": "Tooltip on RTS/DTR Indicators",
    "timestamp": "2025-07-12 16:10",
    "description": "Hovering over the RTS and DTR status indicators now displays a tooltip informing users that changes can be made in Settings."
  },
  {
    "title": "Auto Scroll Status Tooltip",
    "timestamp": "2025-07-05 18:20",
    "description": "Auto Scroll checkbox now provides tooltip explanations depending on its enabled or disabled state."
  },
  {
    "title": "Copy/Save Limitation Tooltip",
    "timestamp": "2025-07-05 18:00",
    "description": "Tooltips on Copy and Save buttons now inform users that only the currently visible buffer will be exported, based on the Max Lines setting."
  },
  {
    "title": "Dark/Light Theme Switcher",
    "timestamp": "2025-07-05 16:10",
    "description": "You can now switch between light and dark themes using the 🌙/☀️ icon above the terminal section. The current theme is saved across sessions."
  },
  {
    "title": "Auto-Clear Feature Added",
    "timestamp": "2025-07-05 14:35",
    "description": "The app can now automatically clear terminal output after a specified time interval while connected. This option is configurable via Settings."
  },
  {
    "title": "Display Format Selector Added",
    "timestamp": "2025-07-04 21:15",
    "description": "Users can now switch between Normal, Hex, and JSON display formats directly in the main interface."
  },
  {
    "title": "Settings Persistence for Timestamp Format and Line Ending",
    "timestamp": "2025-07-04 20:40",
    "description": "The application now remembers your preferred timestamp format (12h/24h) and line ending settings using localStorage."
  },
  {
    "title": "Settings Reset to Default",
    "timestamp": "2025-07-04 19:50",
    "description": "A reset button has been added to the settings modal to restore default values for all options."
  },
  {
    "title": "Settings Stored with Local Persistence",
    "timestamp": "2025-07-04 19:05",
    "description": "Changes made in the Settings modal, such as Baud Rate, Max Lines, and Show Timestamp, are now saved and restored after browser refresh."
  },
  {
    "title": "New Feature: Input Clear Button",
    "timestamp": "2025-07-04 16:12",
    "description": "We have added an 'X' button next to the input field to allow users to quickly clear the entered command."
  },
  {
    "title": "UI Enhancements in Terminal Section",
    "timestamp": "2025-07-03 10:45",
    "description": "The terminal input and output sections have been restyled for better usability and readability."
  }
]
